Catalogs/ХранилищеШаблонов/ХранилищеШаблонов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХранилищеШаблонов</name>
  <predefined>
    <items>
      <name>ШаблонЦенникБольшой</name>
      <description>Шаблон ценника (большой)</description>
    </items>
    <items>
      <name>ШаблонЦенникМалый</name>
      <description>Шаблон ценника (малый)</description>
    </items>
    <items>
      <name>ШаблонЦенникПринтерЭтикеток</name>
      <description>Шаблон ценника (принтер)</description>
    </items>
    <items>
      <name>ШаблонЭтикеткаБольшой</name>
      <description>Шаблон этикетки (большой)</description>
    </items>
    <items>
      <name>ШаблонЭтикеткаМалый</name>
      <description>Шаблон этикетки (малый)</description>
    </items>
    <items>
      <name>ШаблонЭтикеткаОбувь</name>
      <description>Шаблон этикетки (обувь)</description>
    </items>
    <items>
      <name>ШаблонЭтикеткаПринтерЭтикеток</name>
      <description>Шаблон этикетки (принтер)</description>
    </items>
  </predefined>
  <attributes>
    <name>XMLОписаниеМакета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерМакета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоляШаблона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаркированнаяПродукция</name>
    <comment>используется для этикеток маркированной продукции</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьРамки</name>
    <comment>для маркированной продукции</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Поля</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоУмолчанию</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Формат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Catalogs/ХранилищеШаблонов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	Макет = Справочники.ХранилищеШаблонов.ПолучитьМакет("ШаблоныЭтикеток");
	НомерСтроки = 1;
	
	ИмяПредопределенного = Макет.Область(НомерСтроки, 1, НомерСтроки, 1).Текст;
	
	Пока  ИмяПредопределенного <> "" Цикл
		
		ШаблонСсылка = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ХранилищеШаблонов."+ИмяПредопределенного);
		Если ШаблонСсылка <> Неопределено 
			И НЕ ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонСсылка, "XMLОписаниеМакета")) Тогда
			
			ШаблонОбъект = ШаблонСсылка.ПолучитьОбъект();
			
			ШаблонОбъект.XMLОписаниеМакета      = Макет.Область(НомерСтроки, 2, НомерСтроки, 2).Текст;
			ШаблонОбъект.РазмерМакета           = Макет.Область(НомерСтроки, 3, НомерСтроки, 3).Текст;
			ШаблонОбъект.МаркированнаяПродукция = (Макет.Область(НомерСтроки, 4, НомерСтроки, 4).Текст = "1");
			ШаблонОбъект.ВыводитьРамки          = Истина;
			ШаблонОбъект.ПоляШаблона            = "ПоляШаблонаНоменклатура";
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонОбъект);
		КонецЕсли; 
		
		НомерСтроки = НомерСтроки + 1;
		ИмяПредопределенного = Макет.Область(НомерСтроки, 1, НомерСтроки, 1).Текст;
	КонецЦикла;
	
КонецПроцедуры

Функция ПараметрыШаблонаЭтикеток(Знач ШаблонЭтикетки) Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Наименование");
	Результат.Вставить("АдресХранилищаСКД");
	Результат.Вставить("XMLОписаниеМакета");
	Результат.Вставить("ВыводитьРамки", Истина);
	
	РеквизитыОбъекта = Новый Структура("Наименование, ПоляШаблона, XMLОписаниеМакета, ВыводитьРамки");
	
	Если ТипЗнч(ШаблонЭтикетки) = Тип("СправочникОбъект.ХранилищеШаблонов") Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыОбъекта, ШаблонЭтикетки);
	Иначе
		Если ТипЗнч(ШаблонЭтикетки) = Тип("Строка") Тогда
			ШаблонЭтикетки = "Справочник.ХранилищеШаблонов."+ШаблонЭтикетки;
		КонецЕсли; 
		
		РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ШаблонЭтикетки, РеквизитыОбъекта);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(РеквизитыОбъекта.ПоляШаблона) Тогда
		Возврат Результат;
	КонецЕсли; 
	
	МакетПоляШаблона = Справочники.ХранилищеШаблонов.ПолучитьМакет(РеквизитыОбъекта.ПоляШаблона);
	
	Результат.Вставить("Наименование",      РеквизитыОбъекта.Наименование);
	Результат.Вставить("АдресХранилищаСКД", ПоместитьВоВременноеХранилище(МакетПоляШаблона, Новый УникальныйИдентификатор));
	Результат.Вставить("XMLОписаниеМакета", РеквизитыОбъекта.XMLОписаниеМакета);
	Результат.Вставить("ВыводитьРамки",     РеквизитыОбъекта.ВыводитьРамки);
	
	Возврат Результат;
КонецФункции 

#КонецОбласти 

#Область ОбработчикиОбновления

Процедура УстановитьПризнакВыводитьРамки() Экспорт
	СправочникВыборка = Справочники.ХранилищеШаблонов.Выбрать();
	
	Пока СправочникВыборка.Следующий() Цикл
		Объект = СправочникВыборка.ПолучитьОбъект();
		Если Объект = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		Объект.ВыводитьРамки = Истина;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
	КонецЦикла; 
КонецПроцедуры
 
#КонецОбласти 


#КонецЕсли
